import streamlit as st
import pandas as pd
import numpy as np
import altair as alt




import streamlit as st

st.markdown(
    """
   
        <h1 style="text-align: center;">!! امتلك وظيفتك الان</h1>
        <p>في هذا الزمن العرض أقل من الطلب ، الكثير يبحث عن الوظيفة المناسبة ل العيش في سعادة ،لكن مهلا … أصبحت الوظائف فيها تنافس عالي جدآ لكن لو تنظرها بمنظور إيجابي بأن الكفاءات العالية تفيد المجتمع لو ننظر قبل 15 سنة الدنيا سبهلله و اغلبها واسطات لكن الان اصبح كل شيئ تقني و زاد عدد الخريجين مما ادا الى الناس تطور مهاراتها لكي تحصل على الوظيفة</p>
   
    """,
    unsafe_allow_html=True
)

st.image("1.png",use_column_width=True)


st.markdown(
    """
        <p>نشاهد أن منطقة الرياض تحتل المرتبة الاولى في توفر الوظائف مقارب الضعف في المركز الثاني </p>
        <br>
        <br>
        <h6>ممكن يطرح الناس اسئلة بأن الوظائف اصبحت اغلبها للنساء ماهي صحة المعلومة؟ </h6>
   
    """,
    unsafe_allow_html=True
)

st.image("2.png",  use_column_width=True)

st.markdown(
    """
        <p>الوظائف المشتركة هي الأكثر  و يميل الرجال أكثر من النساء في الوظائف  </p>
        <br>
        <br>

        <h6>طيب هنالك الكثيرين من الخريجين يستفسرون حول نطاق الرواتب ؟</h6>
  
    """,
    unsafe_allow_html=True
)

st.image("3.png",  use_column_width=True)

st.markdown(
    """
        <p> نلاحظ أن رواتب الذين ليس لديهم خبرات متدنية للغاية ( ما يأكل طير )   </p>
        <br>
        <br>
        <h6>طيب هل تستهدف فرص العمل في المقام الأول الأفراد ذوي الخبرة، أم هل هناك مجال للخريجين الجدد أيضًا؟</h6>
   
    """,
    unsafe_allow_html=True
)

st.image("4.png",  use_column_width=True)

st.markdown(
    """
          <p>🙂 صراحه انصدمت بأن الوظائف للخريجين معروضة بشكل أكبر  لكن معلومة جميلة    </p>
        <br>
        <br>
        <h6>طيب مادام أن الخريجين اكثر اريد اعرف وش هي المناطق التي توفر للخريجين </h6>
    
    """,
    unsafe_allow_html=True
)

st.image("5.png",  use_column_width=True)

st.markdown(
    """
   
        <h6>لا شيء جديد الرياض الاول ياحسافة التعب   ( امزح 💀 )</h6>
    
    """,
    unsafe_allow_html=True
)


st.markdown(
    """
       <br>
        <br>
        <br>
        <br>
        
        <p>في الختام يجب علينا أن نجتهد كما قال الصفدي المتوفى قبل ٧٠٠ سنة في مطلع لاميته </p>
        <h4الجَدُّ في الجدِّ والحِرمانُ في الكَسَلِ * * * فانصبْ تُصِبْ عنْ قريبٍ غايةَ الأملِ</h4>
        <p>احب ان اسمع هذه القصيدة لكي أتحمس و أنصح الجميع بسماعها </p>

  
    """,
    unsafe_allow_html=True
)




